benchmarks/workloads/gateway.yaml
schema_version: 1
name: gateway-promotion
defaults:
  model: qwen3-4b
  stream: true
  temperature: 0.0
  top_p: 1.0
  max_tokens: 32
execution:
  warmup_requests: 0
  rounds: 2
  concurrency: 2
  timeout_seconds: 90
prompts:
  - id: short-ko
    messages:
      - role: user
        content: 연속 배칭을 한 문장으로 설명해 주세요.
  - id: arithmetic
    messages:
      - role: user
        content: 17 더하기 25의 답만 말해 주세요.