benchmarks/workloads/load.yaml
schema_version: 1
name: qwen-steady-load
defaults:
  model: Qwen/Qwen3-4B
  stream: true
  temperature: 0.0
  top_p: 1.0
  max_tokens: 128
  chat_template_kwargs:
    enable_thinking: false
execution:
  warmup_requests: 4
  rounds: 10
  concurrency: 8
  timeout_seconds: 90
prompts:
  - id: repeated-prefix-a
    messages:
      - role: system
        content: You are a concise assistant for an internal model-serving handbook. Use three bullets and no introduction.
      - role: user
        content: List common causes of high time-to-first-token.
  - id: repeated-prefix-b
    messages:
      - role: system
        content: You are a concise assistant for an internal model-serving handbook. Use three bullets and no introduction.
      - role: user
        content: List common causes of high time-per-output-token.
  - id: repeated-prefix-c
    messages:
      - role: system
        content: You are a concise assistant for an internal model-serving handbook. Use three bullets and no introduction.
      - role: user
        content: List common causes of low request goodput.