benchmarks/workloads/smoke.yaml
schema_version: 1
name: qwen-smoke
defaults:
  model: Qwen/Qwen3-0.6B
  stream: false
  temperature: 0.0
  top_p: 1.0
  max_tokens: 16
  chat_template_kwargs:
    enable_thinking: false
execution:
  warmup_requests: 0
  rounds: 1
  concurrency: 1
  timeout_seconds: 90
prompts:
  - id: json-arithmetic
    messages:
      - role: system
        content: Answer briefly.
      - role: user
        content: What is 12 plus 30?
  - id: sse-arithmetic
    parameters:
      stream: true
    messages:
      - role: system
        content: Answer briefly.
      - role: user
        content: What is 18 plus 24?